#! /bin/bash

# Этот скрипт должен запускаться из под root

# Входные параметры: 1 - ip адрес клиента (по умолчанию 192.168.11.151)

if [[ -z "$1" ]]; then
  CLI_IP=192.168.11.151
else
  CLI_IP=$1
fi

# Устанавливаем набор софта для самостоятельной сборки пакета
# rpmdevtools - это базовый набор утилит, чтобы сделать процесс сборки RPM-пакетов более простым, быстрым и безопасным. Вместо того чтобы вручную создавать структуру папок и писать конфигурационные файлы с нуля, эти утилиты автоматизируют рутину.
# rpm-build - это базовый системный пакет в AlmaLinux, который содержит саму утилиту rpmbuild. Это «движок», который выполняет всю реальную работу: компилирует код, собирает файлы в архив и подписывает метаданные готового RPM-пакета. 
# createrepo - (в современных версиях AlmaLinux 8 и 9 классический createrepo заменен на его быструю версию на языке C - createrepo_c - это утилита, которая превращает обычную папку с RPM-пакетами в полноценный локальный или сетевой DNF/YUM репозиторий
# yum-utils -  набор сервисных утилит для продвинутого управления репозиториями, пакетами и исходным кодом в Red Hat-системах (включая AlmaLinux 8 и 9). Хотя в современных версиях AlmaLinux пакетным менеджером стал dnf, имя пакета yum-utils сохранено для обратной совместимости, а сами утилиты внутри оптимизированы под API DNF. 
# cmake - кроссплатформенная система автоматизации сборки, которая сама по себе не компилирует код, а генерирует файлы управления сборкой (например, Makefile для make или файлы проекта для Ninja). 
# gcc - основной компилятор в AlmaLinux, без которого невозможно собрать ни одну программу, написанную на языках C, C++ или Fortran. 
dnf install -y nano wget rpmdevtools rpm-build createrepo yum-utils cmake gcc git

# Создадим папку для пакета и перейдем в нее
mkdir /root/rpm && cd /root/rpm

# Cкачаем официальный пакет исходного кода Nginx для дальнейшей работы над ним - SRPM (Source RPM) 
# При установке такого пакета в домашней директории создается дерево каталогов для сборки
dnf download --source nginx

# Распакуем исходный код и конфигурационные файлы для последующей сборки пакета.
# Распаковка исходников: Файлы из .src.rpm архива (исходный код .tar.gz, патчи и nginx.spec файл) распаковываются в дерево каталогов сборки ~/rpmbuild/
# -U (Upgrade) — обновляет или устанавливает пакет.
# -i (Install) — устанавливает пакет исходного кода в рабочую директорию сборщика.
# -v (verbose) — отображает подробный ход выполнения.
# -h (hash) — выводит строку из символов # (прогресс-бар)
# (Для .src.rpm лучше использовать -i вместо -U, чтобы не замещать старые версии спек-файлов, если они были изменены).
# Для SRPM -U и -i ведут себя одинаково, потому что исходные RPM не устанавливаются, а просто распаковываются.
# Для обычных бинарных RPM (.rpm) разница есть:  
# -U обновляет пакет, а -i просто устанавливает новый, не удаляя старую версию.  
# В случае SRPM можно смело использовать -i, так как обновление здесь не имеет смысла.  
# Эта команда установит файлы в каталог /root/rpmbuild/SOURCES/ и /root/rpmbuild/SPECS/
# Файлы помещаются в соответствующие директории:  
# SPECS/ — файл спецификации (.spec), описывающий процесс сборки.  
# SOURCES/ — архив с исходным кодом и возможные патчи. 


#rpm -Uvh nginx*.src.rpm
rpm -ivh nginx*.src.rpm

# Поставим все зависимости для сборки пакета Nginx:
# Автоматически найдем и установим все пакеты и библиотеки (зависимости), необходимые для компиляции и сборки Nginx.
dnf builddep -y nginx

# Скачаем исходный код модуля ngx_brotli
# --recurse-submodules – автоматически загружает и инициализирует все вложенные подмодули (если они есть).
# В проекте ngx_brotli используется подмодуль с основной библиотекой Brotli. 
# Если просто выполнить git clone, код подмодуля не загрузится, и сборка может не работать.
# С --recurse-submodules репозиторий загружается полностью, включая все зависимости.
# -j8 – указывает количество параллельных потоков (в данном случае 8) для загрузки подмодулей, что ускоряет процесс.
cd /root
git clone --recurse-submodules -j8 https://github.com/google/ngx_brotli
cd /root/ngx_brotli/deps/brotli
mkdir out && cd out

# Собираем модуль ngx_brotli:
cmake -DCMAKE_BUILD_TYPE=Release -DBUILD_SHARED_LIBS=OFF -DCMAKE_C_FLAGS="-Ofast -m64 -march=native -mtune=native -flto -funroll-loops -ffunction-sections -fdata-sections -Wl,--gc-sections" -DCMAKE_CXX_FLAGS="-Ofast -m64 -march=native -mtune=native -flto -funroll-loops -ffunction-sections -fdata-sections -Wl,--gc-sections" -DCMAKE_INSTALL_PREFIX=./installed ..
cmake --build . --config Release -j 2 --target brotlienc

# Отредактируем конфигурацию nginx
# index - Определяет файлы, которые будут использоваться в качестве индекса.
# autoindex on - вывод списка файлов каталога
sed -i 's@listen       80;@index        index.html index.htm;\n        autoindex    on;\n        listen       80;@g' /root/rpmbuild/SOURCES/nginx.conf

# Чтобы Nginx собирался с необходимыми нам опциями добавляем указание на модуль в раздел %build в файле nginx.spec
sed -i 's@if ! \./configure \\@if ! ./configure \\\n    --add-module=/root/ngx_brotli \\@g' /root/rpmbuild/SPECS/nginx.spec

# Собираем RPM пакет
# -b - выполняется сборка
# -bb — только бинарного пакета (.rpm),
# -ba — бинарного, и исходного (.src.rpm).
# -D 'debug_package %{nil}' - отключает автоматическое создание пакета отладочной информации (debuginfo). 
# По умолчанию rpmbuild создаёт дополнительный *-debuginfo.rpm, содержащий символы отладки. 
# -D позволяет переопределить макрос debug_package, установив его в nil, что означает отсутствие отладочного пакета.
cd /root/rpmbuild/SPECS/
rpmbuild -ba nginx.spec -D 'debug_package %{nil}'

# Копируем пакеты в общий каталог
cp /root/rpmbuild/RPMS/noarch/* /root/rpmbuild/RPMS/x86_64/

#  Теперь можно установить наш пакет и убедиться, что nginx работает:
# yam localinstall -y *.rpm
# localinstall — специальная команда, которая:
#   Устанавливает .rpm файлы из локальной директории (а не из репозиториев).
#   Автоматически разрешает зависимости путём загрузки недостающих пакетов из репозиториев.
# В dnf команда localinstall больше не нужна — просто указываем путь к файлу.
cd /root/rpmbuild/RPMS/x86_64/
dnf install -y *.rpm
systemctl enable --now nginx
#systemctl start nginx
systemctl status nginx

# Будем использовать nginx для доступа к своему репозиторию
# Директория для статики у Nginx по умолчанию /usr/share/nginx/html. Создадим там каталог для репозитория
mkdir /usr/share/nginx/html/repo

# Копируем в него собранные RPM-пакеты
cp /root/rpmbuild/RPMS/x86_64/*.rpm /usr/share/nginx/html/repo/

# Инициализируем репозиторий
createrepo /usr/share/nginx/html/repo/
